
'''Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є буква "о" 
(враховуються як великі так і маленькі). Цикл не повинен завершитися, якщо користувач ввів слово без букви "о".'''
print('Шукаємо букву \"о\"')
while True:
    word = input('Введіть слово з буквою \"о\" кирилицею ')

    if 'о' in word.lower():
        print('У слові є буква о')
        break
    else:
        print("В цьому слові немає букви о. Будь ласка, введіть слово з буквою о")

'''Є list з даними lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']. 
Напишіть код, який свормує новий list (наприклад lst2), який містить лише змінні типу стрінг, які присутні в lst1.
Зауважте, що lst1 не є статичним і може формуватися динамічно від запуску до запуску.'''

lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']
lst2 = []

for item in lst1:
    if type(item) == str:
        lst2.append(item)

print('list2:', lst2)

'''Є стрінг з певним текстом (можна скористатися input або константою). Напишіть код,
 який визначить кількість слів в цьому тексті, які закінчуються на "о" (враховуються як великі так і маленькі).'''

test_str = 'Пальто несло молоко і пило вино'
print('У фразі: ' + (str(test_str)))
amount = 0

for word in test_str.split(' '):
    if word.lower().endswith('о'):
        amount = amount + 1

print((str(amount) + ' слів закінчуються на буву \'о\''))




